Repository: bdragon300/rt-extension-fieldscontrol
Catalog: po/*.po
Languages: ru

source: FieldsControl configuration
ru: Конфигурация FieldsControl

source: "Fails if" section fields
ru: Поля секции "Неудача, если"

source: Help
ru: Помощь

source: If several values are assigned to Role or CustomField, each value will be tested
ru: Если роли или дополнительному полю присвоено несколько значений, то каждое из них будет проверено

source: Test will be skipped if field is not applied to a ticket or a queue
ru: Тест будет пропущен если поле не применимо к тикету или очереди

source: Current role members add for test such as current CF values on the 'BulkUpdate' page
ru: Текущие члены группы добавляются к проверке, также как и текущие значения дополнительных полей на странице 'Множественное изменение'

source: Boolean fields (with question sign in name, e.g. IsUser?) can be tested only against values: '1' is true, empty is false
ru: Логические поля (со знаком вопроса в имени, например, IsUser?) могут быть сравнены только со значениями: '1' -- истина, пустое значение -- ложь

source: All datetime values must be in GMT timezone in following format
ru: Все значения даты и времени должны быть в часовом поясе GMT в следующем формате

source: Examples of tests
ru: Примеры тестов

source: Error if field is empty
ru: Ошибка если поле пустое

source: Error if Due value not in range September, 2018
ru: Ошибка если значение поля Дан срок не находится в диапазоне Сентябрь 2018г.

source: Error if CF.dont_change has changed
ru: Ошибка если CF.dont_change изменилось

source: Error if user group contains or added in Role.users_only
ru: Ошибка если группа пользователей содержится или добавляется в Role.users_only

source: or
ru: или

source: Remove restriction
ru: Удалить ограничение

source: Do you want to remove restriction?
ru: Вы действительно хотите удалить ограничение?

source: FieldsControl restriction
ru: Ограничение FieldsControl

source: Restriction #%1 removed
ru: Ограничение #%1 удалено

source: ERROR: Cannot remove restriction #%1. Contact your RT administrator
ru: ОШИБКА: Невозможно удалить ограничение #%1. Обратитесь к своему администратору RT

source: ERROR: Name field is required
ru: ОШИБКА: Поле Имя обязательно для заполнения

source: ERROR: Bad TicketSQL: %1
ru: ОШИБКА: Неправильный TicketSQL: %1

source: ERROR: Section "%1", test #%2
ru: ОШИБКА: Секция "%1", тест #%2

source: ERROR: bad aggregation in section "%1"
ru: ОШИБКА: неправильный тип объединения в секции "%1"

source: ERROR: "%1" section must contain at least one test
ru: ОШИБКА: Секция "%1" должна содержать хотя бы один тест

source: Configuration saved
ru: Конфигурация сохранена

source: ERROR: Cannot save configuration: %1
ru: ОШИБКА: Невозможно сохранить конфигурацию: %1

source: Common
ru: Общее

source: Applies to
ru: Применяется к

source: Pages
ru: Страницы

source: TicketSQL selection
ru: Выборка TicketSQL

source: New ticket state tests
ru: Проверки нового состояния тикета

source: Add field
ru: Добавить поле

source: Fails if
ru: Неудача, если

source: Field
ru: Поле

source: Operation
ru: Операция

source: Value
ru: Значение

source: Old value
ru: Старое значение

source: IGNORE?
ru: ИГНОРИРОВАТЬ?

source: DELETE?
ru: УДАЛИТЬ?

source: ERROR: request aborted because of following restrictions:
ru: ОШИБКА: запрос был прерван из-за следующих ограничений:

source: ...... Failed fields: [ %1 ]
ru: ...... Неверные поля: [ %1 ]

source: ...... Comment: %1
ru: ...... Комментарий: %1

source: ERROR: Ticket #%1 request aborted because of following restrictions:
ru: ОШИБКА: Тикет #%1 запрос был прерван из-за следующих ограничений:

source: ERROR: unknown error in FieldsControl module. Contact your RT administrator. Message: %1
ru: ОШИБКА: неизвестная ошибка в модуле FieldsControl. Обратитесь к своему администратору RT. Сообщение: %1

source: ERROR: The ticket was changed by someone at the same time as you. Please make your changes again.
ru: ОШИБКА: Тикет был изменен кем-то одновременно с Вами. Пожалуйста, повторите Ваши изменения.

source: Ticket.Subject
ru: Тикет.Тема

source: Ticket.Status
ru: Тикет.Статус

source: Ticket.Priority
ru: Тикет.Приоритет

source: Ticket.InitialPriority
ru: Тикет.Начальный приоритет

source: Ticket.FinalPriority
ru: Тикет.Конечный приоритет

source: Ticket.TimeEstimated
ru: Тикет.Расчётное время

source: Ticket.TimeWorked
ru: Тикет.Время в работе

source: Ticket.TimeLeft
ru: Тикет.Осталось времени

source: Ticket.QueueId
ru: Тикет.Очередь (ID)

source: Transaction.Attach
ru: Транзакция.Вложение

source: Transaction.Content
ru: Транзакция.Содержимое

source: Transaction.Worked
ru: Транзакция.В работе

source: Transaction.Subject
ru: Транзакция.Тема

source: Transaction.One-time-CC
ru: Транзакция.Однократная копия

source: Transaction.One-time-Bcc
ru: Транзакция.Однократная скрытая копия

source: Transaction.Sign
ru: Транзакция.Цифровая подпись

source: Transaction.Encrypt
ru: Транзакция.Зашифровать

source: FieldsControl restriction list
ru: Список ограничений FieldsControl

source: Create new FieldsControl restriction
ru: Создать новое ограничение FieldsControl

source: Name
ru: Имя

source: equal
ru: равно

source: not equal
ru: не равно

source: match regex
ru: соответствует рег. выр.

source: not match regex
ru: не соответствует рег. выр.
